Revit 2024 API
EdgeEndPoint Methods
The EdgeEndPoint type exposes the following members.
Methods
Name | Description
Dispose
Equals(Object)
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Equals(EdgeEndPoint)
 Determines whether this EdgeEndPoint is equal to another.
Evaluate
 Evaluate the end point of the edge in 3d coordinates.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace